src/AccumulationRegisters/ДоступныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>ДоступныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПлатежныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/CommonModules/КонтрольОстатков/Ext/Module.bsl
Функция ОстаткиВалютыДостаточны(ПлатежнаяСистема, Валюта, Дата, ПутьКПолю, СуммаДокумента) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоступныеСредстваОстатки.ПлатежнаяСистема КАК ПлатежнаяСистема,
	|	ДоступныеСредстваОстатки.Валюта КАК Валюта,
	|	ДоступныеСредстваОстатки.СуммаВВалютеОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ДоступныеСредства.Остатки(
	|			&Дата,
	|			ПлатежнаяСистема = &ПлатежнаяСистема
	|				И Валюта = &Валюта) КАК ДоступныеСредстваОстатки
	|ГДЕ
	|	ДоступныеСредстваОстатки.СуммаВВалютеОстаток < 0");
	Запрос.УстановитьПараметр("Валюта",Валюта);
	Запрос.УстановитьПараметр("ПлатежнаяСистема",ПлатежнаяСистема);
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// суммма выборки отрицательная
		Остаток = СуммаДокумента + Выборка.Сумма;
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Недостаточно средств для списания. Всего на счете %1: %2 %3'"),
			Строка(Выборка.ПлатежнаяСистема), Строка(Остаток), Строка(Выборка.Валюта));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ПутьКПолю, , Отказ);
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции
